In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('tissue_union.bed', header = None, sep = '\t')
df.head()

      0      1      2   3           4
0  chr1   9920  10727  98  228.306122
1  chr1  40772  41742   7  505.142857
2  chr1  41916  42557   9  517.444444
3  chr1  46815  47046   2  184.000000
4  chr1  53306  53515   2  195.500000

In [3]:
df.shape

(753526, 5)

In [4]:
df.describe()

                  1             2              3              4
count  7.535260e+05  7.535260e+05  753526.000000  753526.000000
mean   7.970622e+07  7.970689e+07      20.487243     331.216853
std    5.654557e+07  5.654556e+07      44.551223     212.327024
min    9.920000e+03  1.015900e+04       1.000000      20.000000
25%    3.380748e+07  3.380800e+07       2.000000     155.458750
50%    6.973658e+07  6.973714e+07       5.000000     293.910428
75%    1.168339e+08  1.168351e+08      17.000000     464.500000
max    2.489449e+08  2.489464e+08     725.000000    1000.000000

In [5]:
df = df[(df[3] >= 3) & (df[4] >= 155.5)]
df.shape

(419090, 5)

In [6]:
df.isna().sum()

0    0
1    0
2    0
3    0
4    0
dtype: int64

In [7]:
df.head()

      0       1       2    3           4
0  chr1    9920   10727   98  228.306122
1  chr1   40772   41742    7  505.142857
2  chr1   41916   42557    9  517.444444
6  chr1   78787   79757   15  672.933333
7  chr1  180804  181918  106  307.028302

In [8]:
df.to_csv('filtered.bed', sep = '\t', index = False, header = False)